#include <stdio.h>
#include "sortmethod.h"

void main()
{
	//int a[] = {52, 33, 52, 89, 76, 12, 25, 64};
	/*int a[] = {5, 6 ,18, 8, 16, 18, 25};*/
	//int a[] = {5, 6 ,8, 18, 26, 38, 45};
	int a[] = {55, 46 ,38, 28, 16, 8, 5};
	printf("**排序前：");
	show(a, 7);
/********************** 测试冒泡排序 **********************/
	//{
	//	int CompareNum;	
	//	printf("\n冒泡排序后：");
	//	CompareNum = BubbleSort(a, 7);
	//	show(a, 7);
	//	printf("冒泡排序的比较次数：%d\n", CompareNum);
	//}

/********************** 测试改进的冒泡排序 **********************/
	//{
	//	int CompareNum;	
	//	printf("\n改进的冒泡排序后：");
	//	CompareNum = BubbleImprovedSort(a, 7);
	//	show(a, 7);
	//	printf("改进的冒泡排序的比较次数：%d\n", CompareNum);
	//}

/********************** 测试快速排序 **********************/
	{
		extern int quickSortNum;
		printf("\n快速排序后：");
		QuickSort(a, 0, 6);  // 0---无序区下限值，6---无序区上限值
		show(a, 7);
		printf("一共经过 %d 趟排序，完成快速排序\n", quickSortNum);
	}

/********************** 测试简单插入排序(直接插入排序) **********************/
	//{
	//	printf("\n简单插入排序(直接插入排序)后：");
	//	StraightInsertSort(a, 7);
	//	show(a, 7);
	//}

/********************** 测试希尔排序(缩小增量排序) **********************/
	//{
	//	printf("\n希尔排序(缩小增量排序)后：");
	//	ShellSort(a, 7);
	//	show(a, 7);
	//}

/********************** 测试简单选择排序(直接选择排序) **********************/
	//{
	//	printf("\n简单选择排序(直接选择排序)后：");
	//	SimpleSelectionSort(a, 7);
	//	show(a, 7);
	//}

/********************** 测试堆排序 **********************/
	//{
	//	printf("\n堆排序后：");
	//	HeapSort(a, 7);
	//	show(a, 7);
	//}
}